pitzDaily/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  
    frontback
    {
        type            empty;
 
    }
    top
    {
        type            noSlip;

    }
    in
    {
        type            fixedValue;  //Dirichlet
        value           uniform (5.91e-4 1.04e-4 0);
       
    }
    bottom
    {
        type            noSlip;
       
    }
    out
    {
        type            zeroGradient;

        
    }
    prism
    {
        type            noSlip;

    }
}


// ************************************************************************* //
