pitzDaily/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  
    frontback
    {
        type            empty;
 
    }
    top
    {
        type            zeroGradient;

    }
    in
    {
        type            zeroGradient;
       
    }
    bottom
    {
        type            zeroGradient;
       
    }
    out
    {
        type            fixedValue;
        value		uniform 0;
        
    }
    prism
    {
        type            zeroGradient;

    }
}

// ************************************************************************* //
